[Language]
DisplayName=中文

[0]
0=GUI TAB GENERAL
1=日志
2=主机器人日志
3=日志方式
4=使用设定的日志方式
5=使用分割方式显示日志
6=机器人日志和收益日志一样大小
7=大机器人日志, 小的收益日志
8=小机器人日志, 大的收益日志
9=全部机器人日志, 隐藏收益日志
10=隐藏机器人日志, 全部收益日志
11=清除收益日志
12=这种方式清除收益日志
13=复制到剪切板
14=使用这种方式复制收益日志(CTRL+C)
15=收益日志
16=                   --------  收益 --------       ----- 奖励 ------
17=" 时间|奖杯.|搜索次数| 金 | 水| 黑 水|奖 杯.|星|  金|水| 黑水|L."

[1]
0=GUI TAB TROOPS
1=部队
2=军队组成
3=设置军队方式
4=使用兵营模式 或者 使用自己手动定制模式
5=模式: 弓箭手
6=模式: 野蛮人
7=模式: 哥布林
8=模式: 野蛮人+弓箭手
9=模式: 野蛮人+弓箭手+巨人+哥布林
10=模式: 野蛮人+弓箭+巨人
11=模式: 野蛮人+弓箭手+哥布林
12=模式: 野蛮人+弓箭手+哥布林+巨人+炸弹人
13=使用兵营模式
14=自定义军队
15=兵营模式
16=设置训练营的部队
17=野蛮人
18=弓箭手
19=巨人
20=哥布林
21=炸弹人
22=气球兵
23=法师
24=天使
25=龙
26=皮卡
27=部队的强度（整个比例）
28=全营的：
29=训练营军队达到 '全部' 当达到这个比例百分之, 就开始攻击.
30=加速设置
31=训练营
32=多少个训练营进行加速! 谨慎使用！
33=左边加速
34=使用宝石加速你的训练营! 谨慎使用!
35=使用宝石加速你得法术工厂! 谨慎使用!
36=使用宝石加速你的黑药水工厂!谨慎使用!
37=使用宝石加速你的野蛮人王!谨慎使用!
38=使用宝石加速你的女王! 谨慎使用!
39=部队
40=设置百分比
41= 制造.
42=总共
43=总百分比要等于100%
44=增加部队（个）
45=输入确定的数目
46=炸弹人
47=增加黑水兵（个数）
48=亡灵
49=野猪
50=武神
51=石头人
52=女巫
53=熔岩猎犬
54=法术（瓶）
55=开始制造法术.
56=雷电
57=治疗
58=狂暴
59=毒药
60=地震
61=药水容量
62=输入药水的数量，如果不使用，请输入0
63=皮卡
64=Use this to boost your Grand Warden with GEMS! Use with caution!
65=EarthQuake

[2]
0=GUI TAB SEARCH
1=搜索
2=只搜索死鱼
3=只搜索活鱼
4=活鱼和死鱼
5=死鱼: 满采集器. 大部分资源在外面.
6=活鱼: 满储存罐.大部分资源在里面.
7=双重模式: 搜死鱼和活鱼,哪一种搜到打哪一种.
8=搜索设置
9=当发现鱼的时候警报提醒我.
10=如果想要警报设置，检查这里 或者是当发现鱼的时候，气泡提醒！.
11=重新开始，每
12=重新返回基地 多少次 搜索 并重新开始搜索
13=搜索
14=死鱼条件  ( 全部的采集器 )
15=延迟开始
16=搜索X次的死鱼, 开始搜索活鱼..
17=搜索次数达到X后开始这种模式.
18=搜索.
19=搜素条件的设定值.
20=和: 两者同时满足,金 和 水.
21=或者: 其中一个条件满足, 金 或者 水.
22=加: 金和水的总数达到
23=金和水
24=金或水
25=金加水
26=设置当金币搜索满足最小值时开始攻击
27=设置水达到搜索的最小值时开始攻击
28=设置金加水的最小开始攻击数值.
29=黑水
30=搜到鱼的黑水最小值
31=设置搜到鱼的黑水达到最小值时开始攻击
32=奖杯
33=搜索的鱼的杯达到设定值
34=达到设定值的最小杯时开始攻击.
35=大本
36=搜索鱼的大本最大等级
37=设定开始攻击的大本最大等级.
38=大本外置
39=搜到大本外置的鱼
40=弱防御
41=搜索的鱼的低等级防御.
42=设定迫击炮的最高等级
43=设定法师塔的最高等级
44=满足一个条件就攻击
45=当满足设定条件中的一个就开始攻击.
46=活鱼设定
47=搜索设定
48=降低目标, 每
49=当搜索达到一定次数后，自动降低搜索条件s.
50=输入次数，达到设置数后，之前的条件重置重新搜索.
51=次，搜索.
52=每一次降低的金币的数值
53=每一次降低的圣水的数值
54=每一次降低的圣水和金币的和的数值.
55=每一次降低的黑水的数值.
56=每一次降低的奖杯的数值
57=搜素模式
58=搜索X次活鱼后开始后，开始搜索死鱼。.
99=Collectors of
100=Enable this option to search for a deadbase with 75% full collectors (default is 90%+ full)
101=Set the Min. level of the elixir collectors to detect.
102=at 75% is DB

[3]
0=GUI TAB ATTACK
1=攻击
2=死鱼配置
3=攻击方向
4=从一边进攻，可以穿透大本
5=从两个方向进攻，可以穿透大本
6=从三个方向进攻, 达到外围，有时候可以打到大本
7=设定进攻方向数
8=一边
9=两边
10=三边
11=均分到每个方向
12=军队
13=使用全部军队
14=使用军营
15=只是用野蛮人
16=只是用弓箭手
17=野蛮人+弓箭手
18=野蛮人+哥布林
19=弓箭手+哥布林
20=野蛮人+弓箭手+巨人
21=野蛮人+弓箭手+巨人+哥布林
22=野蛮人+弓箭手+野猪骑士
23=野蛮人+弓箭手+亡灵
24=延迟设置
25=这是军队进攻延迟设置, 1 (最块) 相当于像机器人, 10 (最慢)相当于像人.
26=随机设定，让机器人更接近人
27=波
28=随机延迟和进攻波数
29=使用智能攻击: 红线附近.
30=使用智能攻击贴近红线下兵
31=下兵方式
32=设定军队波数配置.
33=方式1: 在每一边下一种兵种，一波后，再转换成其他的兵种,或者
34=方式 2: 在每一边下一个兵种（例如：哥布林，弓箭手，野蛮人）的全部兵力后再转换成下另一兵种
35=下一边, 然后换军队
36=下完部队, 然后换边
37=在金矿附近下兵
38=在圣水采集器附近下兵
39=在黑水采集器附近下兵
40=使用蛮王
41=在进攻时使用蛮王.
42=使用女王
43=进攻时使用女王.
44=使用盟兵
45=使用盟兵（如果盟兵有兵）
46=活鱼配置
47=平衡部落城堡兵
48=平衡 捐/收
49=如果你的捐收比大于下面的设定值使用你的部落兵.
50=捐兵比率
51=理想捐收比率
52=1/1 捐收平衡, 1/2 捐=收的一半.
53=接受的比率
54=英雄技能
55=使用英雄后，定时的启动英雄技能
56=使用影响后X秒使用技能
57=全部英雄技能都被激活.
58=当英雄红血时自动使用技能.
59=当英雄变虚弱时自动开启技能
60=英雄单独使用激活
61=设定X秒后定时开启英雄技能
62=秒
63=平均在所有方向进攻，尽可能打到的大本
64=在一个接近黑水罐的方向进攻
65=在一个接近大本的方向进攻
66=金水方向进攻
67=大本方向进攻
68=战斗使用
69=使用守卫者进攻
70=定时启动守卫者的技能
71=在一定时间使用守卫者的技能
72=设定时间定时启动守卫者的技能
73=Four Fingers
74=Smart Save Troop
75=Four Fingers

[4]
0=GUI TAB ATTACKADV
1=攻击设置2
2=攻击设置
3=立即进攻！设置.
4=勾选这个设置，如果你想使用立即进攻!' 下面的按钮
5=开始和暂停按钮来绕过死鱼或者全部大本搜索值
6=立即攻击，这个按钮就出现在只有搜索到满足条件的村庄时
7=加
8=增加一定的反应时间去减少搜索的次数
9=秒，延迟
10=攻击外置大本
11=勾选这个，攻击大本暴露在外面的村庄
12=提示: 也可提醒 '搜到大本在外' 在搜索页面 ，如果你只是想搜索大本在外的鱼。
13=偷本
14=造兵的时候也进行偷本
15=如果你想训练军队偷本，勾选这个
16=增加小方块数
17=增加从大本边缘开始的方块数目
18=搜索限制
19=最大搜索次数后返回基地
20=最小军队容量（数目）去偷本
21=最小军队数量开始偷本.
22=弱防本攻击组合
23=偷本组合
24=增加偷本设定到当前的搜索设定. (例如: 死鱼 或者偷本)
25=增加
26=输入多少 草坪' 1x1 大小 ，在大本前面的草坪数，会被认为是大本外置
27=Ex: (0) 大小; 大本必须全部一边全部在外. (4) 大小: 大本最近的中心或者距离边缘有4块大小。.
28=如果大本距离设定的值的数目大则.跳过
29=距离大本边缘的方块
30=攻击大本方式
31=攻击：智能攻击
32=攻击: BAM
33=攻击: 最大攻击
34=攻击: 哥布林野蛮人
35=攻击: 自定义
36=智能攻击 野蛮人/弓箭
37=野蛮人/弓箭手/亡灵
38=最大攻击：使用全部军队
39=哥布林/野蛮人/弓箭
40=你自己设定的策略!
41=如果大本在底部
42=配置: 放大
43=配置: 在一边
44=当大本在截图的底部，设置你的配置策略!
45=放大 先放大然后再在底部攻击
46=在一侧 试着不用放大把大本左移动或者右移动, 你的军队可能选择别的目标！
47=使用蛮王
48=当偷本时使用蛮王
49=将在第一波内部署
50=使用雷电
51=当偷本时使用雷电
52=在第三波时使用部署
53=使用女王
54=进行偷本时使用女王
55=在第一波时就使用女王
56=使用狂暴药水
57=偷本时使用治疗药水
58=在第三波部署时使用
59=使用盟兵
60=偷本时使用盟兵
61=将会在第二波时使用盟兵
62=使用治疗药水
63=偷本时使用治疗药水
64=将在第二波时使用
65=弱防本攻击组合
66=弱防本.  然后
67=增级大本偷本设置到搜索设置内. (例如: 死鱼或者 偷本)
68=大本偷本: 达到规定的搜寻次数后降低大本的等级.
69=大本偷本: 偷本前搜寻的次数
70=搜索次数.
71=大本最大等级
72=偷本: 偷本的最大等级
73=发现后，按照设定的进行攻击
74=死鱼攻击
75=使用死鱼攻击模式去匹配偷本攻击
76=活鱼攻击
77=使用活鱼设定的进攻方式去匹配偷本攻击
78=守卫时间刷钱
79=启用守护时间刷钱模式
80=在守卫时间时，启用守卫打钱模式
81=等待时间
82=设定关闭COC的时间，并成功等待获得防御时间. (1-99分钟)
83=分钟
84= 刷钱.最小
85=保留 最小.
86=当金币低于设定值时，放弃防御打钱，转换成正常打钱模式
87=设定你搜寻或者升级所需要的钱的数量
88=需要金币存储的数量时启动防御打钱
89=输入你需要去攻击敌军或者升级的金币数量.
90=如果圣水低于设定的值时，放弃防御打钱，转换成正常打钱模式
91=设定你需要训练军队或者是升级所需要的生水值
92=升水达到要求值时启用防御打钱
93=输入你需要攻击敌军或者升级时需要的生水
94=如果黑水数值低于设定值停止防御打钱, 转换成正常打钱.
95=设定你需要训练军队或者升级所需要的黑水
96=如果黑水的数值满足需求，则启用防御打钱
97=输入你需要进攻敌军或者升级所需要的黑水
98=你可以增加或者编辑进攻 编辑 csv 设置文件 在 THSnipe 文件夹
99=Delay Start
100=Search for a TH Snipe after this No. of searches, start searching for Live Bases first..
101=No. of searches to wait before activating this mode.
102=search(es).
103=Search for a base that meets the values set for Gold And/Or/Plus Elixir.
104=AND: Both conditions must meet, Gold and Elixir.
105=OR: One condition must meet, Gold or Elixir.
106=+ (PLUS): Total amount of Gold + Elixir must meet.
107=G And E
108=G Or E
109=G + E
110=Set the Min. amount of Gold to search for on a village to attack.
111=Set the Min. amount of Elixir to search for on a village to attack.
112=Set the Min. amount of Gold + Elixir to search for on a village to attack.
113=Dark Elixir
114=Search for a base that meets the value set for Min. Dark Elixir.
115=Set the Min. amount of Dark Elixir to search for on a village to attack.
116=Meet One
117=majeur Trap...
118=Save Troops
119=If collectors outside less than Percent Do Action
120=outside col
121=% Use 

[5]
0=GUI TAB ENDBATTLE
1=战斗结束
2=结束战斗
3=当战役获得战利品没有增加在
4=在设定的时间内战利品没有额外的增加.
5=当王和所有部队都释放完毕后开始倒计时
6=秒.
7=资源低于
8=如果金币低于这个数值，结束战斗
9=如果圣水低于这个数值，结束战斗
10=如何黑水低于这个数值，结束战斗
11=当没有资源遗留
12=当全部的金，水，黑水为0时，结束战斗
13=当得到一个星时，赢得游戏
14=在战役中如果得到一星就结束战斗
15=当得到两颗星算赢
16=在战役中如果得到两颗星就结束战斗
17=攻击黑水罐的一边（偷黑）, 结束战斗选项
18=在活鱼配置中激活黑水罐一边攻击 - 攻击方式: 选项
19=当低于时
20=激活偷黑特殊条件的设定
21=如果没有增加过滤条件去筛选那么当低于总黑水百分比X时结束战斗
22=禁止普通方式结束战斗 选项
23=当黑水方向进攻被激活后，禁止正常方式结束战斗选项
24=当得到一星后算赢
25=当得到一星时，且黑水低于最少值时结束战斗
26=当
27=当黑水低于最低值时，且蛮王虚弱时，结束战斗
28=处于弱势
29=当黑水低于最低值时且女王虚弱时，结束战斗
30=战利品截图
31=如果你想保存战利品截图请勾选这个选项
32=在文件内包含战利品信息
33=包含战利品信息在截图文件内
34=分享攻击视频
35=分享视频在你的部落内.
36=勾选这个将会在你的部落内分享视频.
37=当战役战利品
38=只有当战役战力品中金币达到这个数值时才分享视频.
39=只有当战利品中圣水达到这个数值时才分享视频
40=只有当战利品中黑水达到这个数值时才分享视频
41=为这个清单使用一个随机信息
42=Nice\r\nGood\r\nThanks \r\nWowwww
43=分享录像是发送信息
44=战利品截图快照

[6]
0=GUI TAB DONATE
1=捐兵
2=请求盟军（此选项只支持英文！）
3=请求：
4=随便什么都可以
5=这个文本是用来在你请求部落兵时所说的话！.
6=捐兵选项菜单
7=野蛮人
8=弓箭手
9=巨人
10=哥布林
11=炸弹人
12=黑名单
13=亡灵
14=野猪
15=女武神
16=自定义
17=气球人
18=法师
19=天使
20=龙
21=皮卡
22=石头人
23=女巫
24=熔岩猎犬
25=按拉丁字母
26=勾选这个激活按字母捐兵
27=捐兵
28=勾选这个捐兵
29=捐给所有请求
30=野猪骑士
31=这是忽略所有关键词
32=捐兵关键词
33=这些关键词不捐兵
34=捐兵黑名单
35=barbarians\r\nbarb
36=no barbarians\r\nno barb\r\nbarbarians no\r\nbarb no
37=archers\r\narch
38=no archers\r\nno arch\r\narchers no\r\narch no
39=giants\r\ngiant\r\nany\r\nreinforcement
40=no giants\r\ngiants no
41=goblins\r\ngoblin
42=no goblins\r\ngoblins no
43=wall breakers\r\nbreaker
44=no wall breakers\r\nwall breakers no
45=balloons\r\nballoon
46=no balloons\r\nballoons no
47=wizards\r\nwizard
48=no wizards\r\nwizards no
49=healer
50=no healer\r\nhealer no
51=dragon
52=no dragon\r\ndragon no
53=PEKKA\r\npekka
54=no PEKKA\r\npekka no
55=minions\r\nminion
56=no minions\r\nminions no
57=hogriders\r\nhogs\r\nhog
58=no hogs\r\nhog no
59=valkyries\r\nvalkyrie
60=no valkyries\r\nvalkyries no
61=golem
62=no golem\r\ngolem no
63=witches\r\nwitch
64=no witches\r\nwitch no
65=lavahound\r\nhound\r\nlava
66=no lavahound\r\nhound no
67=
68=
69=
70=皮卡
71=任何\r\一切
72=第一
73=第二
74=第三
75=无
76=only\r\njust
77=这些关键词不捐兵
78=一般黑水兵
79=clan war\r\nwar\r\ncw
80=普通黑水兵请求
81=如果关键词匹配.
82=捐给所有请求.
83=无
84=Poison Spells
85=Earthquake Spells
86=Haste Spells
87=poison
88=no poison\r\npoison no
89=earthquake\r\nquake
90=no earthquake\r\nquake no
91=haste
92=no haste\r\nhaste no

[7]
0=GUI TAB MISC
1=综合
2=停止攻击
3=使用这些选选项设置去停止机器人进攻
4=停止攻击
5=关闭计算机
6=计算机睡眠
7=重启计算机
8=金和水满了而且达到最大奖杯数
9=金和水满了，或者达到最大奖杯数
10=金或者水满了，而且达到最大奖杯数
11=金或水满了，或者达到最大奖杯数
12=金和水满了
13=金或水满了
14=金满了而且达到最大奖杯数
15=水满了而且达到最大奖杯数
16=金满了或者达到最大奖杯数
17=水满了或者达到最大奖杯数
18=金满
19=水满
20=达到最大奖杯数
21=机器人运行保持
22=现在 只捐兵)
23=现在 (只是保持在线)
24=小时
25=小时
26=转换配置文件
27=当前配置文件
28=是用这里去切换不同的配置文件
29=你的配置文件必须存在！
30=我的村庄
31=你的村庄/配置文件的名字
32=界面语言
33=是用这里去切换不同的界面语言
34=重置 && 重新载入
35=勾选这里进行自动填充你村庄的：陷进, 重载X弩 和地狱塔 （前提是你得有！）
36=收集资源
37=勾选这里用于自动收集你村庄的资源采集器
38=从金矿, 圣水采集器 、黑水钻井
39=清理墓碑（打扫战场）
40=勾选这个自动清理进攻敌人留下的墓碑.
41=恢复机器人
42=恢复当 达到这些的最小值, 如果资源资源低于这些值则停止运行
43=机器人恢复攻击的最小金币值 低于这些值就停止运行
44=机器人恢复攻击的最小圣水值 低于这些值就停止运行
45=机器人恢复攻击的最小黑水值 低于这些值就停止运行
46=杯段设置
47=奖杯范围
48=最小: 机器人将会降杯直到这个值。
49=最大: 机器人将会下降奖杯如果你的奖杯数大于这个值。
50=使用英雄
51=如果英雄可用，使用英雄降杯
52=攻击死鱼
53=在降杯过程中如果发现死鱼，第一时间攻击死鱼。
54=远程配置设置
55=当 '其他设备链接时'等待
56=输入等待时间 (按秒计算) 当其他设备链接后，机器人再次连接的等待时间。
57=秒
58=村庄搜索延迟
59=使用滑条去改变：当搜索村庄攻击和点击下一个之间的等待时间
60=这个可能弥补一些电脑出现失去链接的错误（减少出现失去连接错误）！
61=无法保证! 当然这不会总是有相同的结果！
62=最小
63=秒
64=最大
65=用这个设置激活 村庄随机搜索延迟
66=最大的滑条设置要高于上面最小的滑块的设定值
67=手动定位
68=大本
69=重新定位你的
70=部落城堡
71=军.营.
72=军营
73=训练营.
74=训练营
75=法术.工厂.
76=法术工厂
77=黑药.法术.工厂.
78=黑药水工厂
79=野蛮人之王
80=野蛮人之王圣台
81=女王
82=女王圣台
83=实验室.
84=实验室
85=重置.
86=点击这里重置全部的建筑物位置定位,
87=当你改变你村庄的布局的时候！
88=当...
89=现在 (训练/只捐兵)
90=再装填, 收集, 清理
91=陷进, X弩 && 地狱塔
92=收集资源
93=打扫墓碑
94=大守护者
95=大守护者圣台
96=Drop Trophy Army Min
97=Enter the percent of full army required for dead base attack before starting trophy drop.
98=%

[8]
0=GUI TAB UPGRADE
1=自动升级
2=实验室自动升级
3=勾选这个方框 来激活实验室内的物品自动升级（实验室内物品升级）
4=无
5=野蛮人
6=弓箭手
7=巨人
8=哥布林
9=炸弹人
10=气球兵
11=法师
12=天使
13=龙
14=皮卡
15=雷电法术
16=治疗药水
17=狂暴药水
18=弹跳药水
19=冰冻药水
20=毒药法术
21=地震药水
22=急速药水
23=亡灵
24=野猪骑士
25=女武神
26=石头人
27=女巫
28=熔岩猎犬
29=下一个
30=通过下拉菜单去设置军队的自动升级
31=左边会出现军队的图标.
32=任何黑药水/军队升级优先于英雄升级!
33=英雄连续升级
34=
35=当你有足够的黑水，激活你的蛮王的自动升级 (保留最小的黑水值)
36=你可以在 综合 设置标签内定位你的蛮王的圣台位置
37=恢复机器人需要对比你的 黑药的值 （在综合标签与这里保留最小黑水值）!
38=
39=当你有足够的黑水时激活女王自动升级 (保留最小的黑水值)
40=你可以在 综合 标签内定位你的女王圣台位置
41=重启机器人时对比你的黑水值（这里的最小值和综合标签内的）
42=建筑物 或 英雄
43=升级
44=勾选小方框，激活升级
45=在使用定位升级按钮后
46=X坐标
47=Y坐标
48=这里显示升级方式
49=定位升级物
50=选中升级建筑物/英雄，再按下按钮来定位和记录
51=升级重置
52=按下按钮重置 & 移除全部的升级物定位信息
53=状态: 红色=不可编辑, 黄色=可以编辑,没有完成, 绿色=完成
54=最小.金币
55=升级完成后保存这么多量的金币.
56=设定需要保留的金币值用于搜索 或者城墙升级.
57=最水圣水
58=升级完成后保留这么多；量的圣水
59=设定需要保留的圣水值用于造军队或者 城墙升级
60=最小黑水
61=当升级万仇保留这么多量的黑水值.
62=设定的值要高于你造军队战斗需要的值.
63=城墙
64=自动城墙升级
65=勾选这个如果有足够的资源将自动升级城墙
66=使用金币
67=只使用金币升级城墙
68=全部可用的城墙等级
69=使用圣水
70=只使用圣水升级城墙.
71=只有当城墙能够使用圣水升级时才可用.
72=优先使用圣水，再使用金币
73=圣水优先. 如果圣水不足升级，再使用金币升级城墙.
74=只有当城墙能够使用圣水升级是才可用
75=保留一个建筑工人用于升级城墙
76=勾选这个用于仅仅保留一个建筑工人用于升级城墙 和
77=减少可用的1个建筑工人升级去升级另外的建筑
78=查找城墙等级
79=搜寻这个等级的城墙 并且一个一个的升级.
80=下一级城墙费用
81=使用这个值作为指标.
82=如果你选择别的等级的墙，这个值将会更新
83=保留的最小金币值
84=当升级完成后保留这个量的金币值
85=设定这个金币值用于其他建筑物升级或者搜索
86=保留的最小圣水值
87=当升级完成后保留这个量的圣水值
88=设定这个值用于其他建筑物升级或者制造军队
89=实验室
90=测试和发现城墙的位置和数量. 越高越好，但是慢.
91=测试
92=点击这里来测试城墙检测.
93=自动升级你的英雄
94=当你有足够的圣水时激活你的大守卫者自动升级 (保留最小圣水值)
95=你可以在综合标签内手动的定位你的大守卫者圣台
96=启动机器人先检查对比综合标签内的最小圣水值和这里的圣水最小值!

[9]
0=GUI TAB NOTIFY
1=通知
2=PushBullet 提醒
3=激活
4=激活 PushBullet 通知
5=远程控制
6=激活远程控制功能
7=开始删除信息
8=这个是当你开启机器人时，删除以前的推送信息
9=现在删除全部信息
10=点击这里删除全部 Pushbullet信息.
11=删除比这更早的信息
12=删除比设定的时间更早的全部推送信息
13=设置删除信息的时间间隔.
14=小时
15=小时
16=访问令牌（Token）
17=你需要一个令牌用来推送信息. 从 PushBullet.com得到令牌信息
18=简况/村庄名字
19=你的简况/村庄名字 - 这个的设定可以在综合标签下面找到.
20=使用这些选项发送一个推送信息
21=找到匹配
22=发送找到的要攻击的村庄的可以获得的总共资源数.
23=用照片方式发送最后战役
24=发送最后袭击的战利品截图.
25=用文本方式发送最后战役
26=发送最后战役使用文本形式发送.
27=军营满营
28=当军营满营时，发送一个警告提示信息.
29=城墙升级
30=发送一个城墙升级信息
31=报错: 不同步（掉线）
32=当你报错的时候发送信息: Client and Server out of sync
33=休息一下
34=当你村庄在线时间太长了，发送一个信息提示你需要休息下.
35=村庄信息
36=发送村庄信息.
37=最新攻击警报
38=发送关于最新的攻击警报信息
39=另外的设备链接
40=发送一个信息提示：另外一个设备正在链接.
41=PushBullet 远程控制功能
42=BOT HELP - 发送帮助信息
43=BOT DELETE  - 删除你以前的全部推送信息
44=BOT <Village Name> RESTART - 重新启动 （村庄名字）的机器人和BS
45=BOT <Village Name> STOP - 停止<村庄名字>机器人 
46=BOT <Village Name> PAUSE - 暂停 <村庄名字>机器人
47=BOT <Village Name> RESUME   - 恢复<村庄名字>机器人
48=BOT <Village Name> STATS - 发送村庄统计信息 <村庄名字>
49=BOT <Village Name> LOG - 发送当前<村庄名字>的日志文件 
50=BOT <Village Name> LASTRAID -  发送<村庄名字>最后战役的收获截图 
51=BOT <Village Name> LASTRAIDTXT - 发送<村庄名字>的最后战役的最后获得战利品 
52=BOT <Village Name> SCREENSHOT - 发送<村庄名字>屏幕截图 
53=Enable Telegram
55=Enable Telegram notifications
54=Access Token T:
56=You need a Token to use Telegram notifications. Get a token from @BotFather

[10]
0=GUI TAB EXPERT
1=专家
2=当机器人载入时
3=检查升级
4=勾选将检查你的机器人是不是最新版本.
5=删除日志文件
6=删除比指定日期更长的日志文件
7=日
8=删除缓存文件
9=删除比指定日期更长的缓存文件.
10=删除战利品截图
11=删除比指定日期更长的战利品截图图片.
12=当机器人开始时
13=自动开始后
14=秒.
15=检查游戏语言 (EN)
16=检查游戏语言是不是设定正确 (必须设定为 English).
17=自动调整
18=复位/调整  BS和机器人窗口 屏幕 
19=抵消设置
20=抵消在BS和机器人窗口之间的水平像素
21=抵消在BS和机器人窗口之间的垂直像素
22=0,0: BS-Bot
23=0,0: Bot-BS
24=对齐: Bot 右对齐 BS
25=对齐: Bot 左对齐 BS
26=对齐: Bot 右下角对齐 BS
27=对齐: Bot 左下角对齐 BS
28=0,0: 复位 BS 屏幕 重新定位 0,0 在系统桌面 机器人窗口左或者右对齐它.
29=对齐: 只是重排窗口, 对齐机器人窗口和BS窗口 右上对齐t,左上对齐, 右下对齐 或 左下对齐t.
30=T定时
31=训练军队
32=延迟
33=如果你的电脑反应慢，增加延迟
34=调试
35=调试: 点击(x,y)坐标写入日志.
36=调试: 激活调试SetLog消息代码故障排除.
37=调试: 激活保存OCR图像进行故障排除.
38=调试: 激活保存图片进行故障排除
39=调试: 激活在日志中显示建筑物位置坐标信息.
40=坐标.
41=L
42=O
43=I
44=B
45=其它选项
46=军营总兵力
47=如果没有检测到兵营总兵力，用询问来替代
48=部落援兵配置
49=只有在下列时间段捐助援兵！
50=这个按钮将清除或设置整个下面的复选框
51=只有在下列时间段请求援兵！
52=只有在下列时间段使用援兵！
53=训练营加速设置
54=只有在这些时间段加速
55=屏幕截图照片选项
56=保存为PNG格式
57=隐藏村庄和部落的名字
58=在这个时间秒后 自动开始机器人
59=上午
60=下午

[11]
0=GUI TAB STATS
1=统计
2=开始值
3=报表
4=将显示
5=着这里
6=第一次运行.
7=当你开始运行时金币的数值.
8=当你开始运行时圣水的数值.
9=当你开始运行时黑水的数值.
10=当你开始运行时降杯的数值.
11=最近一次攻击
12=你最近一次攻击的得到的金币数.
13=你最后一次攻击得到的圣水数.
14=你最后一次攻击得到的黑水值.
15=你最后一次攻击得到的降杯数.
16=战役奖励
17=最近一次进攻，战争奖励的金币
18=最近一次进攻，战争奖励的圣水
19=最近一次进攻，战争奖励的黑水.
20=总收益
21=在机器人运行期间的金币总收益数
22=(这个包含手动升级建筑物花费的资源)
23=在机器人运行期间的圣水总收益数
24=在机器人运行期间的黑水总收益数
25=在机器人运行期间的奖杯总收益数.
26=每小时收益
27=金币收益/每小时
28=圣水收益/每小时
29=黑水收益/每小时
30=奖杯收益/每小时
31=统计重置
32=统计:综合
33=进攻
34=机器人进攻次数.
35=跳过
36=机器人搜寻时跳过的次数.
37=用金币升级
38=使用金币升级城墙的数目
39=用圣水升级
40=使用圣水升级城墙的数量.
41=使用金币升级建筑物的数量
42=使用圣水升级建筑物的数量
43=升级英雄
44=英雄升级数量
45=降杯
46=在综合设置标签设置的奖杯范围内，降低的奖杯数.
47=运行时间
48=机器人总共运行的时间
49=升级花费金币数
50=升级城墙花费的金币
51=升级花费的圣水
52=通过圣水升级城墙花费的圣水
53=通过金币升级建筑物花费的金币
54=通过圣水升级建筑物花费的圣水
55=升级用掉黑水：
56=升级英雄所花费的黑水
57=丢失连接数
58=连接错误的数量
59=搜索成本
60=跳过村庄所花费的金币
61=训练军队成本
62=训练军队所花费的圣水
63=训练黑水成本
64=使用黑水兵时所花费的黑水
65=收集的金币
66=自己金矿收集的金币
67=圣水收集
68=自己采集器采集到的圣水
69=黑水采集
70=暗黑矿井收集到的黑水
71=死鱼
72=攻击
73=攻击死鱼的次数.
74=收益
75=死鱼攻击获得的金币量.
76=死鱼攻击获得的圣水量.
77=死鱼攻击获得的奖杯数.
78=活鱼
79=活鱼攻击次数.
80=活鱼攻击获得的金币量
81=活鱼攻击获得的圣水量
82=活鱼攻击获得的黑水量
83=活鱼攻击获得的奖杯量.
84=弱防本
85=在攻击中，弱防本的数量
86=弱防本攻击中获得到的金币量
87=弱防本攻击中获得到的圣水量.
88=弱防本攻击中获得到的黑水量.
89=弱防本攻击中获得到的奖杯量.
90=偷本
91=偷本过程中获得到的金币量.
92=偷本过程中获得到的圣水量.
93=偷本过程中获得到的黑水值.
94=偷本过程中获得到的奖杯量.
95=偷本成功个数
96=偷本失败个数
97=这以后
98=每次攻击.
99=将更新
100=死鱼攻击中获得到的黑水量.
101=The No. of TH Snipes attacked by the Bot.

[12]
0=GUI TAB ABOUT US
1=关于
2= 
3= 翻译 benchu1219
4= 
5= 
6= 
7= 
8= 
[13]
0=GUI BOTTOM
1=开 始
2=停 止
3=暂 停
4=使用这个暂停机器人所有活动，知道你恢复
5=恢复
6=使用这个来恢复暂停的机器人
7=搜索模式
8=不攻击.搜索满足条件的村庄.
9=拍照
10=点击这个将对你的村庄进行屏幕快照，并保存到一个文件内
11=隐藏
12=使用这个把安卓窗口移出你的视线
13=(不是最小化, 但是隐藏了)
14=背景
15=模式
16=勾选这个激活机器人的背景模式
17=使用这个你也能够将BS窗口隐藏，移出你的视线
18=死鱼攻击!
19=活鱼攻击!
20=偷本!
21=村庄
22=村庄报表
23=将显示在这里
24=第一次运行.
25=显示
26=- 免费机器人 -


[18]
0=pushbullet
1=a
2=Help
3=Pause
4=Resume
5=Delete
6=Power
7=Hibernate
8=Shut down
9=Standby
10=Cancel
11=Lastraid
12=Last raid txt
13=Stats
14=Screenshot
15=Restart
16=Stop
17=You can remotely control your bot by selecting this key
18=HELP - send this help message
19=DELETE  - Use this if Remote dont respond to your request
20=RESTART - restart the bot and bluestacks
21=STOP - stop the bot
22=PAUSE - pause the bot
23=RESUME   - resume the bot
24=STATS - send Village Statistics
25=LASTRAID - send the last raid loot screenshot. you should check Take Loot snapshot in End Battle Tab 
26=LASTRAIDTXT - send the last raid loot values
27=SCREENSHOT - send a screenshot
28=POWER - select powr option
29=Request for Help
30=Request to Pause
31=Request to Resume
32=There is no last raid screenshot.
33=Last Raid txt
34=Stats Village Report
35=At Start
36=Now (Current Resources)
37=No. of Free Builders
38=No. of Wall Up
39=Attacked
40=Skipped
41=Request to Restart...
42=Your bot and BS are now restarting...
43=Request to Stop...
44=Your bot is now stopping...
45=Your bot is currently stopped, no action was taken
46=Command not recognized
47=Please push BOT HELP to obtain a complete command list.
48=select your remote
49=select POWER option
50=PC got Hibernate
51=PC got Shutdown
52=PC got Standby
53=canceled
54=Unable to Upload File
55=Occured an error type 2 uploading file to Telegram server...
56=Last Gain
57=Bot restarted
58=Restarted after Out of Sync Error
59=Attacking now...
60=Last Raid txt
61=Last Raid
62=Found Wall level
63= Wall segment has been located...
64=Upgrading ...
65=Cannot find Wall level
66=Skip upgrade ...
67=Another Device has connected
68=Another Device has connected, waiting 
69= hours 
70= minutes 
71= seconds
72=Chief, we need some rest!
73=Village must take a break...
74=CoC Has Stopped Error .....
75=Request to Pause...
76=Your request has been received. Bot is now paused
77=Request to Resume...
78=Your request has been received. Bot is now resumed
79=Disconnected after 
80= skip(s)
81=Cannot locate Next button, Restarting Bot...
82= Match Found! after 
83=Upgrade completed by using GOLD
84=Complete by using GOLD ...
85=Upgrade completed by using ELIXIR
86=Complete by using ELIXIR ...
87=No Upgrade Gold Button
88=Cannot find gold upgrade button ...
89=No Upgrade Elixir Button
90=Cannot find elixir upgrade button ...
91=Screenshot of your village
92=Your Army Camps are now Full
93=Your bot is currently paused, no action was taken
94=Your bot is currently resumed, no action was taken
95=Last Raid
96=My Village
[14]
1=Attack Scripted
2=DeadBase Deploy
17=IMG
18=Make IMG with extra info in Profile -> Temp Folder
3=Use Scripted attack for Dead Bases
4=Use scripted attack for dead bases, this disables standard attack
5=Choose the script; You can edit/add new scripts located in folder: 'CSV/Attack'
6=Reload Script Files
15=Show/Edit current Attack Script
16=Create a new Attack Script
19=Copy current Attack Script to a new name
7=Use in battle
8=Use your King when Attacking...
9=Use your Queen when Attacking...
10=Use your Warden when Attacking...
11=Drop your Clan Castle in battle if it contains troops.
39=Use your Light Spells when Attacking...
40=Use your Healing Spells when Attacking...
41=Use your Rage Spells when Attacking...
42=Use your Jump Spells when Attacking...
43=Use your Freeze Spells when Attacking...
44=Use your Poison Spells when Attacking...
45=Use your Earthquake Spells when Attacking...
46=Use your Haste Spells when Attacking...
12=LiveBase Deploy
13=Use Scripted attack for Live Bases
14=Use scripted attack for live bases, this disables standard attack
28=Hero Abilities
31=Auto activate (red zone)
32=Activate the Ability when the Hero becomes weak.
33=Heroes are checked and activated individually.
29=Timed after
56=Activate the Ability on a timer.
30=All Heroes are activated at the same time.
34=Set the time in seconds for Timed Activation of Hero Abilities.
35=sec.
36=Timed activation of Warden Ability after
37=Use the ability of the Grand Warden on a timer.
38=Set the time in seconds for Timed Activation of Grand Warden Ability.
22=ClanCastle Balance
23=Balance D/R
24=Drop your Clan Castle only if your donated/received ratio is greater than D/R ratio below.
25=Donated ratio
26=Wanted donated / received ratio
54=1/1 means donated = received, 1/2 means donated = half the received etc.
27=Received ratio
47=Create New Script File
48=New Script Filename
49=File exists, please input a new name
50=An error occurred when creating the file.
51=Copy to New Script File
52=Copy
53=to New Script Filename
[16]
1=SmartZap Attack
2=Use Lightning
3=Check this to drop Lightning Spells on top of drills of Dark Elixir.
4=Auto-Training of Spells
5=This option is to continuously create lightning spells.
6=Min. amount of Dark Elixir
7=The added value here depends a lot on what level is your TH, put a value between 500-1500.
8=Tips
9=Remember to go to the tab 'troops' and put the maximum capacity of your spell factory and the number of spells so that the bot can function perfectly.
10=Status
11=Number of dark elixir zapped during the attack with lightning.
12=Amount of used spells.
13=TH snipe DE Drill Zap
16=SmartZap
14=Zap DE Drills
15=Use this if you want to Zap Drill when TH Snipping
[19]
33=Profiles
1=Profiles
2=Current Profile:
3=Use this to switch to a different profile. Default: 01
4=Your profiles/configs can be found in:
5=MyVillage
6=Your village's name
7=Gold Switch Profile Conditions
8=Switch To
9=Enable this to switch profiles when gold is above amount.
10=Select which profile to be switched to when conditions met
11=When Gold is Above
12=Set the amount of Gold to trigger switching Profile.
13=Enable this to switch profiles when gold is below amount.
14=When Gold is Below
15=Elixir Switch Profile Conditions
16=Enable this to switch profiles when Elixir is above amount.
17=When Elixir is Above
18=Set the amount of Elixir to trigger switching Profile.
19=Enable this to switch profiles when Elixir is below amount.
20=When Elixir is Below
21=Dark Elixir Switch Profile Conditions
22=Enable this to switch profiles when Dark Elixir is above amount.
23=When Dark Elixir is Above
24=Set the amount of Dark Elixir to trigger switching Profile.
25=Enable this to switch profiles when Dark Elixir is below amount.
26=When  Dark Elixir is Below
27=Trophy Switch Profile Conditions
28=Enable this to switch profiles when Trophies are above amount.
29=When Trophies are Above
30=Set the amount of Trophies to trigger switching Profile.
31=Enable this to switch profiles when Trophies are below amount.
32=When Trophies are Below
[17]
1=Choose majeur Trap
2=Choose which defense is majeur Trap
3=If this box is checked, then the bot will look
4=Enable Inferno Tower detect
6=Enable Mortar detect
8=Enable Wizard detect
9=Wizard near TownHall.
10=Enable Tesla detect
11= Tesla near TownHall.
12=Enable Air defense detect
13= Air defense near TownHall.
14=Enable Archer detect
15= Archer tower near TownHall.
16=Enable Canon detect
17= Canon near TownHall.
18=Tolerance
19=Use this slider to adjust the tolerance of ALL images.
20=If you want to adjust individual images, you must edit the files.
21=Save And Close
[15]
5= Inferno Tower near TownHall.
7=Mortar near TownHall.
